Flat_Plate_GitHub/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)//0
    (1 0 0)//1
    (1 1 0)//2
    (0 1 0)//3
    (0 0 0.1)//4
    (1 0 0.1)//5
    (1 1 0.1)//6
    (0 1 0.1)//7
    //New Vertices
    (6 0 0)//8
    (6 1 0)//9
    (6 0 0.1)//10
    (6 1 0.1)//11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 40 1) simpleGrading (0.2 20 1)//first block
    hex (1 8 9 2 5 10 11 6) (100 40 1) simpleGrading (3i 20 1)//second block
);

edges
(
);

boundary
(
    zeroGradientPlanes
    {
        type patch;
	faces
        (
	(1 5 4 0)//bottom left side
	(8 9 11 10)//right side outlet
	(3 7 6 2)//top left
	(2 6 11 9)//top right
	);
    }
    Plate
    {
        type wall;
	faces
	(
	     (1 8 10 5) //Flat plate
        );
    }
    Inlet
    {
	type patch;
	faces
	(
	    (0 4 7 3) //left side
	);
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) //front side
            (4 5 6 7) //back side
	    (1 2 9 8)
	    (5 10 11 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
